{
    "students": [
        {"id":"1", "name": "João", "title":"A Lua está linda hoje", "letter": "Oi Talita, tudo bem? Espero que goste da galeria de fotos do terceiro info 2024 ksks. Um projeto autoral e com conceitos aprendidos nas últimas aulas! Bem, agora sobre a carta... Gostaria de começar agradecendo pelos quase três anos de convívio (foram simplesmente os melhores três anos da minha vida!), as aulas incríveis e sempre com muita alegria, melhorando a terça-feira de qualquer um que estivesse presente ali naquela sala... Muito obrigado por me proporcionar tantas oportunidades, seja participando de monitoria, ajudando os colegas em sala, preparando workshops, laboratório de informática, oportunidades também de continuar progredindo além da grade acadêmica, com cursos, informações e, sempre que necessário, uma ajudinha em algo específico de JS ou React Native ksksksk. Tem tantos assuntos que eu gostaria de conversar... Ideias de projetos, trabalhos, workshops, estudos e até mesmo de trilhas e caminhadas ou lugares que sonho em viajar. De fato, muita coisa aconteceu na minha vida nesses últimos três anos, consegui meu objetivo de ingressar no instituto federal, viajei para diversos lugares lindos no Brasil e, os mais marcantes, em intercâmbio de estudo nas melhores universidades do mundo, Harvard, MIT, Stanford, Berkeley, até a Nasa consegui conhecer ksksk, e a cada lugar que conhecia, pensava e tinha cada vez mais vontade de trazer isso pra casa, desenvolver, de alguma forma, aquelas ideias brilhantes para que todos pudessem também ter acesso a esse tipo de projeto. Havíamos até conversado sobre a possibilidade de como criar algo do tipo, e agora voltei com mais ideias! Uma pena não ter dado tempo de colocá-las em prática... E, inclusive, te garanto que estarei novamente ajudando na organização do laboratório de informática! Quero muito que seja algo bem especial dessa vez. Para evitar me prolongar ainda mais, gostaria que soubesse o quanto te admiro, sem dúvida uma das minhas inspirações. Muito, muito obrigado mesmo por esses três anos, foram simplesmente inesquecíveis!! Desejo tudo de bom pra você, dê o seu melhor no programa de doutorado, tenho certeza que o trabalho será incrível! Deixarei algumas fotos que gostaria de te mostrar, nada muito específico, mas sem dúvidas muito importantes! Novamente, muito obrigado por tudo.", "nImages": "27"},
        {"id":"2", "name": "André Ressude", "title":"A melhor de todas!", "letter": "Querida Talita, ainda não caiu a ficha que não vai mais dar para nós!! Meu Deus!! Mas fico muito feliz com essa oportunidade que você está tendo. Mais um passo pra frente na sua história. Saiba que a sua felicidade é a minha também. Muito obrigado por todas as suas aulas, por todos os momentos e por toda a ajuda que me deste durante esses anos. Suas aulas me ajudaram muito durante esses anos e me ajudaram a achar um norte a seguir em minha futura carreira. Sem contar que a sua ajuda e direcionamento foram essenciais para o meu projeto da bragantec junto com os meninos e sem você com certeza não teríamos conseguido. Obrigado por todas as aulas perfeitamente ministradas e por, em todas elas, você ter demonstrado a todos o quanto ama fazer isso!! Vou sentir muito a sua falta esse resto de ano e os anos que ficarei aqui sem você como prof em ADS (se Deus quiser que eu passe aqui, é claro). Ainda não creio nisso!! Saiba que você é uma professora super exemplar!! Incrível!!! E também é muito forte e perseverante, até porque mesmo quando, muitas vezes, a sala se dispersava e perdia a atenção você não desistia e dava um jeito de voltar a atenção da sala à ti. Além de professora, continue sendo essa PESSOA incrível e maravilhosa que você é! Você merece muita coisa que está por vir ainda. Por certo terão muitas dificuldades ainda pela frente, mas as vitórias serão maiores!! Deus te abençõe muito por tudo o que fez por mim e por nós do 3⁰ info e que Ele continue abençoando o seu caminhar daqui pra frente!! Você é a melhor de todas!!! Te amamos muuuitão!! Um abração, André Ressude.", "nImages": "3"},
        {"id":"3", "name": "Lucas Almeida", "title":"❤️", "letter":  "Oiii Talitha. É mto estranho ver vc saindo do if, um dos meus motivos de querer continuar aq e fzr faculdade foi vc KKKKKK mas fico feliz q vc esteja indo pra mlr faculdade do Brasil. Lembro de qdo eu era da turma B no 1° ano, e todo mundo falava q tinha uma professora de informática q era linda, super legal, e mto inteligente. Na época eu nem sabia oq queria da vida, mas queria mto ter aula com essa pessoa só pra matar a curiosidade. Um dia aleatório eu troquei um papo com vc, e fiquei tipo \"mds realmente ela é mto legal\". Um ano depois fui ter aula com vc, e eu fiquei admirado o qto vc era inteligente e tinha uma didática incrível. Msm sendo aula dps do almoço, meu único esforço era por conta do sono pós almoço de smp, pq a aula smp foi algo q eu conseguia me concentrar e aprender facilmente. Minha mãe conhece vc de tanto eu falar de vc p ela, q vc é a melhor professora do if e q ainda dava a minha matéria favorita, era um casamento perfeito. Uma coisa q eu nunca cheguei a conversar com vc, mas q eu percebi é q parece mto q vc é uma pessoa q ama a Deus, e isso é a característica q eu mais admiro em alguém e q mais eu busco ter, e eu via isso em vc, msm não sabendo oq vc segue, mas se for, parabéns pq são poucas pessoas que são como vc (outra coisa, nunca vi uma professora tão amada qto vc, em 3 anos nunca vi alguém falar mal de vc, todo mundo te ama). Com ctz vc é uma pessoa q eu vou me lembrar a minha vida toda, vc é uma referência de pessoa pra mim e não vou esquecer de vc tão facilmente. Vc conseguiu ser a melhor professora da minha vida msm me dando aula só por um ano e meio, e eu vou smp lembrar de vc com mto carinho e com mta admiração pelo q vc fez e ainda continua fzd. Um beijão viu Talitha, q Deus te abençoe mto aí na usp, e tomara q a gnt se veja mais vezes, vou sentir mta sdds de vc, amo vc Talitha ❤️", "nImages": "3"},
        {"id":"4", "name": "Gabriel Moraes", "title":"Mais que uma boa professora.", "letter": "Talita, eu entrei no 1° ano sem saber quase nada de informática, meu foco principal era o ensino médio. Pensei que iria penar um pouco nas matérias técnicas e não achei que fosse gostar muito, e ao decorrer dos anos, me encontrei pensando o contrário. Isso devo em parte à senhora! Nos apresentou a matéria como algo divertido e fácil de entender, trouxe leveza ao aprendizado, e isso é uma das melhores atitudes que um professor pode trazer para suas aulas. Espero que assim como nós do 1°, 2° e atual 3° Info, a senhora tenha professores tão bons como a senhora, nessa sua nova jornada no ensino. Desejo as mais sinceras felicidades e boa sorte! Sei que a senhora ainda tem um longo caminho a percorrer nessa área docente, que em todos esses anos, provou mais de uma vez, ter uma excelente vocação. Abraços de seu aluno, Gabriel Moraes.", "nImages": ""},
        {"id":"5", "name": "Isabely e Mariana Godoi", "title":"Muito obrigada!", "letter": "Algumas imagens importantes para mim", "nImages": "4"},
        {"id":"6", "name": "Cailon", "title":"Essa Talita arrasa!", "letter": "Talitaaaa, vcc arrassa muitoo, te desejo todo sucesso do mundo inteiro! Vc ficou marcada na minha vida, como uma das melhores professoras do mundoo! Sucesso!!!", "nImages": "1"},
        {"id":"7", "name": "Marília", "title":"Cartinha", "letter": "Oi, pro!! Tudo bem? Bom, sei que apareci em outras galerias de foto, mas acho legal fazer uma também. Primeiramente, desculpa por mentir pra você em nome da Apollo (espero que tenha acreditado), mas foi por uma boa causa. Confesso que estou em negação que você vai sair temporariamente da escola, mesmo sabendo que vai ser muito bom pra você, mas mesmo assim é triste. Acho que me apeguei a você mesmo não tendo aula desde sempre (e percebo isso na maioria do pessoal da turma B também). Você é uma professora maravilhosa e adoro suas aulas (mesmo sendo de informática) e com certeza vou sentir muita falta de você no IF, assim como todo mundo.  Espero que tenha gostado da surpresa e espero te ver na Bragantec e Formatura!! Vamos cobrar, ein ;) Obrigada, pro!! Como você sempre diz: por hoje é só. 05/08/2024", "nImages": "2"},
        {"id":"8", "name": "Lorena", "title":"Muito obrigada!", "letter": "Talitaa sua linda… Espero que tenha muita sorte nessa sua nova jornada. Sou profundamente grata por ter você como mentora e por todo o conhecimento que compartilha com tanto carinho. Com admiração e respeito, Lorena Batalha ❤️", "nImages": "1"},
        {"id":"9", "name": "Mariana Godoi", "title":"Talita, a mulher maravilha 🦸🏻‍♀️", "letter": "Talita, a senhora com certeza é uma inspiração de quem eu quero ser, sempre alegre, gentil  e uma grande mulher! Aprendi muito com você, e guardarei isso sempre (menos as aulas de log). Te desejo tudo de bom e de melhor e que Deus ilumine cada passo seu ❤️", "nImages": ""},
        {"id":"10", "name": "Liga Jovem", "title":"Galeria", "letter": "Oi, Talita!!! A Apollo Connect e a New Dot montamos essa pequena galeria de fotos pra você lembrar junto com a gente da melhor semana que já tivemos juntos!!! Agradecemos por nos acompanhar em cada evento e também por ser uma ótima professora, uma ótima orientadora e, principalmente, uma ótima amiga. Muito obrigadada por tudoooo!!! ❤", "nImages": "10"},
        {"id":"11", "name": "Gabriel Henrique", "title":"Obigado!", "letter": "As aulas de web sempre foram umas das mais aguardadas da semana pela forma leve e didática com a qual você as comandava! Espero que essa sala tenha sido tão importante pra você quanto você foi para ela. Obrigado por tudo e por todos os ensinamentos. Sucesso na nova caminhada!", "nImages": "3"},
        {"id":"12", "name": "Guilherme", "title":"Carta", "letter": "Oi, Talitinha, ops, Talita. Obrigado por todas as aulas desde o primeiro ano, uma das professoras mais dedicadas e bem-humoradas que eu ja tive o prazer de receber ensinamentos. Espero que seu futuro seja brilhante, boa sorte no crossfit, ciclismo, obrigado por tudo!", "nImages": ""},
        {"id":"13", "name": "Sanmara", "title":"Cartinha", "letter": "Talita,Eu me lembro que algumas semanas antes de fazer minha matrícula no IF eu fiquei muito indecisa de que estava fazendo a coisa certa, tinha muitas dúvidas se valeria a pena voltar do segundo pro primeiro ano do EM só pra entrar naquela escola. Se a Sanmara de 2022 soubesse que no IF ela iria conhecer pessoas incríveis como você, que mudariam totalmente o rumo da vida dela, com certeza a dúvida de se matricular nem existiria. Talita, você não tem noção da quantidade de vezes que já me encorajou e inspirou, se hoje eu sou uma pessoa mais otimista, esforçada, dedicada e muito melhor que antes, é porque você me ajudou e tem parte em tudo isso. Todas as conquistas que eu alcancei durante esses três anos tem uma mãozinha sua, se hoje a New Dot tá virando uma empresa é porque você sempre esteve lá nos fornecendo um apoio incrível e nunca desistiu da gente, e por essas e outras coisas eu sou eternamente grata à você (inclusive, em nome da New Dot peço perdão pelos os apertos e 'fortes emoções', como entregar relatórios 1 minuto antes do prazo, que já te fazemos passarkkkkk). Pra mim, você é exemplo de profissional, de ser humano e de mulher, e quando me perguntam se eu tenho alguma inspiração eu não penso duas vezes antes de falar seu nome. Estou muito feliz (muito mesmo!!!) por você ter passado em um lugar tão incrível pra fazer seu doutorado, mas ao mesmo tempo com o coração apertado por saber que não vai mais ter a Talita chegando toda terça com sua mochilinha e seu sorriso lindo pra dar mais uma aula pra gente... Seja na USP ou em qualquer outro lugar que você for, eu espero que Deus te abençoe muito, irei sempre torcer e orar por você, tenho certeza absoluta que esse é só mais um passo incrível de vários outros que você ainda vai dar. Com muito carinho, San <3", "nImages": "5"},
        {"id":"14", "name": "Mariana Martins", "title":"Cartinha", "letter": "Ooii Talitaaa, eu nem sei por onde eu começo e mesmo que eu escreva um monte, eu não vou conseguir falar tudo que eu realmente sinto e te mostrar o quanto eu sou grata por tudo o quê você fez por mim. Você começou sendo a nossa professora de lógica de programação e a partir daí eu já gostava muito de você, o jeito que você explicava era fácil de entender e divertido, por isso, eu tinha vontade que a turma B também tivesse aulas com você. Desde o comecinho eu lembro o quanto eu ficava nervosa em cada apresentação, não só em projetos, mas nas matérias da escola também, e você sempre motivou muito eu, a loh e a san... você fez a gente começar a acreditar nas coisas que nós fazíamos e eu te agradeço muito, muito mesmo por isso. Depois de um tempo o nervosismo foi melhorando e hoje é até difícil de comprar kkkk(ainda tem, mas não tem nem como comprar com o começo). Faz muito bem encontrar pessoas que nós gostamos no dia a dia, sorrir e receber um sorriso delas, dar bom dia e receber outro...mesmo sendo coisas bobinhas, isso muda o nosso humor todo, mesmo que seja um dia chato ou ruim. Isso só por saber que tem alguém que está do seu lado e que não vai tudo por água a baixo, mesmo que as coisas dêem errado. Por isso, eu gostaria que tivessem sido bem mais do que três anos te vendo na rotina da nossa sala. Mas, mais que isso eu te desejo muitas experiências novas incríveis e muita alegria em todo seu caminho. Quero que muitas pessoas te conheçam e sejam inspiradas por você. Talita, você inspira muita gente todos os dias e me inspira muuuuuito muito também. Você virou um dos meus referenciais pra quando eu crescer...te desejo tudo de melhor, guarda a gente no coração, você vai sempre ter um espaço no meu❤️ Me desculpa por todas as vezes que eu acabei te trazendo problemas, principalmente no liga jovem, e se eu acabei te decepcionado.", "nImages": "4"}
    ]
}
  